schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
#include "common.h"
// clang-format off
/*****************************************************************************************************************************************************
    MiniWebRadio -- Webradio receiver for ESP32

    first release on 03/2017                                                                                                       */String Version="\
    Version 2.17 Oct 25/2023                                                                                         ";

/*  2.8" color display (320x240px) with controller ILI9341 or HX8347D (SPI) or
    3.5" color display (480x320px) wiht controller ILI9486 or ILI9488 (SPI)

    HW decoder VS1053 or
    SW decoder with external DAC over I2S

    SD_MMC is mandatory
    IR remote is optional

*****************************************************************************************************************************************************/

// THE SOFTWARE IS PROVIDED "AS IS" FOR PRIVATE USE ONLY, IT IS NOT FOR COMMERCIAL USE IN WHOLE OR PART OR CONCEPT. FOR PERSONAL USE IT IS SUPPLIED
// WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
// AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHOR OR COPYRIGHT HOLDER BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF
// CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE

// clang-format on

// global variables
const uint8_t  _max_volume = 21;
const uint16_t _max_stations = 1000;
int8_t         _releaseNr = -1;
int8_t         _currentServer = -1;
uint8_t        _alarmdays = 0;
uint8_t        _cur_volume = 0;           // will be set from stored preferences
uint8_t        _ringvolume = _max_volume; //
uint8_t        _mute_volume = 0;          // decrement to 0 or increment to _cur_volume
uint8_t        _brightness = 0;
uint8_t        _state = 0;                // statemaschine
uint8_t        _commercial_dur = 0;       // duration of advertising
uint8_t        _cur_Codec = 0;
uint8_t        _VUleftCh = 0;             // VU meter left channel
uint8_t        _VUrightCh = 0;            // VU meter right channel
uint8_t        _numServers = 0;           //
uint8_t        _level = 0;
uint8_t        _timeFormat = 24;          // 24 or 12
uint8_t        _staListPos = 0;
uint16_t*      _shuffleArray = NULL;
uint16_t       _staListNr = 0;
uint8_t        _fileListPos = 0;
uint16_t       _fileListNr = 0;
uint8_t        _itemListPos = 0;          // DLNA items
uint16_t       _itemListNr = 0;
int16_t        _alarmtime = 0;            // in minutes (23:59 = 23 *60 + 59)
int16_t        _toneha = 0;               // BassFreq 0...15        VS1053
int16_t        _tonehf = 0;               // TrebleGain 0...14      VS1053
int16_t        _tonela = 0;               // BassGain 0...15        VS1053
int16_t        _tonelf = 0;               // BassFreq 0...13        VS1053
int16_t        _toneLP = 0;               // -40 ... +6 (dB)        audioI2S
int16_t        _toneBP = 0;               // -40 ... +6 (dB)        audioI2S
int16_t        _toneHP = 0;               // -40 ... +6 (dB)        audioI2S
uint16_t       _icyBitRate = 0;           // from http response header via event
uint16_t       _avrBitRate = 0;           // from decoder via getBitRate(true)
uint16_t       _cur_station = 0;          // current station(nr), will be set later
uint16_t       _cur_AudioFileNr = 0;      // position inside _SD_content
uint16_t       _sleeptime = 0;            // time in min until MiniWebRadio goes to sleep
uint16_t       _sum_stations = 0;
uint16_t       _plsEntries = 0;
uint16_t       _plsMaxEntries = 0;
uint16_t       _audioFilesInList = 0;
uint32_t       _resumeFilePos = 0;        //
uint32_t       _playlistTime = 0;         // playlist start time millis() for timeout
uint32_t       _settingsHash = 0;
uint32_t       _audioFileSize = 0;
uint32_t       _media_downloadPort = 0;
const char*    _pressBtn[8];
const char*    _releaseBtn[8];
char           _chbuf[512];
char           _fName[256];
char           _myIP[25];
char           _path[128];
char           _prefix[5] = "/s";
char           _commercial[25];
char           _icyDescription[512] = {};
char           _streamTitle[512] = {};
char*          _lastconnectedfile = nullptr;
char*          _stationURL = nullptr;
char*          _JSONstr = nullptr;
boolean        _f_rtc = false; // true if time from ntp is received
boolean        _f_100ms = false;
boolean        _f_1sec = false;
boolean        _f_10sec = false;
boolean        _f_1min = false;
boolean        _f_mute = false;
boolean        _f_sleeping = false;
boolean        _f_isWebConnected = false;
boolean        _f_isFSConnected = false;
boolean        _f_eof = false;
boolean        _f_eof_alarm = false;
boolean        _f_semaphore = false;
boolean        _f_alarm = false;
boolean        _f_irNumberSeen = false;
boolean        _f_newIcyDescription = false;
boolean        _f_newStreamTitle = false;
boolean        _f_newBitRate = false;
boolean        _f_newLogoAndStation = false;
boolean        _f_newCommercial = false;
boolean        _f_volBarVisible = false;
boolean        _f_switchToClock = false;    // jump into CLOCK mode at the next opportunity
boolean        _f_hpChanged = false;        // true, if HeadPhone is plugged or unplugged
boolean        _f_muteIncrement = false;    // if set increase Volume (from 0 to _cur_volume)
boolean        _f_muteDecrement = false;    // if set decrease Volume (from _cur_volume to 0)
boolean        _f_timeAnnouncement = false; // time announcement every full hour
boolean        _f_playlistEnabled = false;
boolean        _f_playlistNextFile = false;
boolean        _f_logoUnknown = false;
boolean        _f_pauseResume = false;
boolean        _f_accessPoint = false;
boolean        _f_state_isChanging = false;
boolean        _f_SD_Upload = false;
boolean        _f_PSRAMfound = false;
boolean        _f_FFatFound = false;
boolean        _f_SD_MMCfound = false;
boolean        _f_ESPfound = false;
boolean        _f_playAllFiles = false;
boolean        _f_clearLogo = false;
boolean        _f_clearStationName = false;
boolean        _f_shuffle = false;
String         _station = "";
String         _stationName_nvs = "";
String         _stationName_air = "";
String         _homepage = "";
String         _filename = "";
String         _lastconnectedhost = "";
String         _scannedNetworks = "";
String         _curAudioFolder = "/audiofiles";
String         _TZName = "Europe/Berlin";
String         _TZString = "CET-1CEST,M3.5.0,M10.5.0/3";
String         _media_downloadIP = "";
std::vector<String> _names{};
std::vector<char*>  _SD_content;
std::vector<char*>  _PLS_content;

struct dlna_items{
    std::vector<char*> name{};
    std::vector<uint8_t> isDir; // contains boolean
    std::vector<char*> id{};
    std::vector<size_t> size;
    std::vector<char*> uri{};
    std::vector<uint8_t> isAudio; // contains boolean
    std::vector<char*> serverFriendlyName{};
    std::vector<uint8_t> serverId;
    boolean isReady = true;
    std::vector<char*> path{};
    uint8_t level = 0;
} _dlna_items;
struct timecounter {
    uint8_t timer = 0;
    float factor = 2.0;
} _timeCounter;

char _hl_item[13][40]{
    "   Internet Radio   ", // "* интернет-радио *"  "ραδιόφωνο Internet"
    "   Internet Radio   ", //
    "   Internet Radio   ", //
    "        Clock       ", // Clock "** часы́ **"  "** ρολόι **"
    "        Clock       ", //
    "     Brightness     ", // Brightness яркость λάμψη
    "    Audio player    ", // "** цифрово́й плеер **"
    "    Audio player    ", //
    "    Alarm (hh:mm)   ", // Alarm
    "  Off Timer (h:mm)  ", // "Sleeptimer" "Χρονομετρητής" "Таймер сна"
    "        DLNA        ", // Digital Living Network Alliance
    "   Stations List    ",
    "   Audio Files      ",
};

enum status {
    RADIO = 0,
    RADIOico = 1,
    RADIOmenue = 2,
    CLOCK = 3,
    CLOCKico = 4,
    BRIGHTNESS = 5,
    PLAYER = 6,
    PLAYERico = 7,
    ALARM = 8,
    SLEEP = 9,
    DLNA = 10,
    STATIONSLIST = 11,
    AUDIOFILESLIST = 12,
    DLNAITEMSLIST = 13
};

const char* codecname[10] = {"unknown", "WAV", "MP3", "AAC", "M4A", "FLAC", "AACP", "OPUS", "OGG", "VORBIS"};

Preferences pref;
Preferences stations;
WebSrv      webSrv;
WiFiMulti   wifiMulti;
RTIME       rtc;
Ticker      ticker100ms;
IR          ir(IR_PIN); // do not change the objectname, it must be "ir"
TP          tp(TP_CS, TP_IRQ);
File        audioFile;
File        playlistFile;
FtpServer   ftpSrv;
WiFiClient  client;
WiFiUDP     udp;
SoapESP32   soap(&client, &udp);

