schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
boolean saveDefaultIRbuttonsToNVS() { // default values, first init
    pref.putShort("irAddress", 0x00);
    pref.putShort("button_0", 0x52);  // '0';
    pref.putShort("button_1", 0x16);  // '1';
    pref.putShort("button_2", 0x19);  // '2';
    pref.putShort("button_3", 0x0D);  // '3';
    pref.putShort("button_4", 0x0C);  // '4';
    pref.putShort("button_5", 0x18);  // '5';
    pref.putShort("button_6", 0x5E);  // '6';
    pref.putShort("button_7", 0x08);  // '7';
    pref.putShort("button_8", 0x1C);  // '8';
    pref.putShort("button_9", 0x5A);  // '9';
    pref.putShort("button_10", 0x40); // 'm';  // MUTE
    pref.putShort("button_11", 0x46); // 'u';  // VOLUME+
    pref.putShort("button_12", 0x15); // 'd';  // VOLUME-
    pref.putShort("button_13", 0x43); // 'p';  // PREVIOUS STATION
    pref.putShort("button_14", 0x44); // 'n';  // NEXT STATION
    pref.putShort("button_15", 0x4A); // 'k';  // CLOCK <--> RADIO
    pref.putShort("button_16", 0x42); // 's';  // OFF TIMER
    pref.putShort("button_17", 0x00); // '0';
    pref.putShort("button_18", 0x00); // '0';
    pref.putShort("button_19", 0x00); // '0';

    pref.putShort("IR_numButtons", 20);
    // log_i("saveDefaultIRbuttonsToNVS");

    loadIRbuttonsFromNVS();

    return true;
}

void saveIRbuttonsToNVS() {
    uint8_t  ir_addr = ir.get_irAddress();
    uint8_t* ir_buttons = ir.get_irButtons();
    char     buf[12];
    pref.putShort("irAddress", ir_addr);
    for(uint8_t i = 0; i < 20; i++) {
        sprintf(buf, "button_%d", i);
        pref.putShort(buf, ir_buttons[i]);
        log_i("i=%i ir_buttons[i] %i", i, ir_buttons[i]);
    }
    pref.putShort("IR_numButtons", 20);
}

void loadIRbuttonsFromNVS() {
    // load IR settings from NVS
    uint numButtons = pref.getShort("IR_numButtons", 0);
    ir.set_irAddress(pref.getShort("irAddress", 0));
    char    buf[12];
    uint8_t cmd = 0;
    for(uint i = 0; i < numButtons; i++) {
        sprintf(buf, "button_%d", i);
        cmd = pref.getShort(buf, 0);
        ir.set_irButtons(i, cmd);
    }
}

// clang-format off
void updateSettings(){
    if(!_lastconnectedhost)_lastconnectedhost = "";
    JSONVar jObject;
    jObject["volume"]            = (uint8_t)  _cur_volume;
    jObject["ringvolume"]        = (uint8_t)  _ringvolume;
    jObject["alarmtime"]         = (uint16_t) _alarmtime;
    jObject["alarm_weekdays"]    = (uint8_t)  _alarmdays;
    jObject["timeAnnouncing"]    = (bool)     _f_timeAnnouncement;
    jObject["mute"]              = (bool)     _f_mute;
    jObject["brightness"]        = (uint8_t)  _brightness;
    jObject["sleeptime"]         = (uint16_t) _sleeptime;
    jObject["lastconnectedhost"] = (String)   _lastconnectedhost;
    jObject["station"]           = (uint16_t) _cur_station;
    jObject["sumstations"]       = (uint16_t) _sum_stations;
    jObject["toneha"]            = (int16_t)  _toneha; // BassFreq 0...15        VS1053
    jObject["tonehf"]            = (int16_t)  _tonehf; // TrebleGain 0...14      VS1053
    jObject["tonela"]            = (int16_t)  _tonela; // BassGain 0...15        VS1053
    jObject["tonelf"]            = (int16_t)  _tonelf; // BassFreq 0...13        VS1053
    jObject["toneLP"]            = (int16_t)  _toneLP; // -40 ... +6 (dB)        audioI2S
    jObject["toneBP"]            = (int16_t)  _toneBP; // -40 ... +6 (dB)        audioI2S
    jObject["toneHP"]            = (int16_t)  _toneHP; // -40 ... +6 (dB)        audioI2S
    jObject["Timezone_Name"]     = (String)   _TZName;
    jObject["Timezone_String"]   = (String)   _TZString;
    jObject["timeFormat"]        = (uint8_t)  _timeFormat;

    String jO = JSON.stringify(jObject);
    if(_settingsHash != simpleHash(jO.c_str())) {
        File file = SD_MMC.open("/settings.json", "w", false);
        if(!file) {
            log_e("file \"settings.json\" not found");
            return;
        }
        file.print(jO);
        _settingsHash = simpleHash(jO.c_str());
    }
}
// clang-format on

/*****************************************************************************************************************************************************
 *                                                    F I L E   E X P L O R E R                                                                      *
 *****************************************************************************************************************************************************/
// Sends a list of the content of a directory as JSON file
const char* SD_stringifyDirContent(String path) {
    uint16_t JSONstrLength = 0;
    uint8_t  isDir = 0;
    uint16_t fnLen = 0; // length of file mame
    uint8_t  fsLen = 0; // length of file size
    if(_JSONstr){free(_JSONstr); _JSONstr = NULL;}
    if(!SD_listDir(path.c_str(), false, false)) return "[]"; // if success: result will be in _SD_content
    if(psramFound()) { _JSONstr = (char*)ps_malloc(2); }
    else             { _JSONstr = (char*)malloc(2);}
    JSONstrLength += 2;
    memcpy(_JSONstr, "[\0", 2);
    if(!_SD_content.size()) return "[]"; // empty?

    for(int i = 0; i < _SD_content.size(); i++) { // build a JSON string in PSRAM, e.g. [{"name":"m","dir":true},{"name":"s","dir":true}]
        const char* fn = _SD_content[i];
        if(startsWith(fn, "/.")) continue;        // ignore hidden folders
        int16_t idx = indexOf(fn, "\033", 1);     // idx >0 we have size (after ANSI ESC SEQUENCE)
        if(idx > 0) {
            isDir = 0;
            fnLen = idx;
            fsLen = strlen(fn) - (idx + 6);          // "033[33m"
            JSONstrLength += fnLen + 24 + 8 + fsLen; // {"name":"test.mp3","dir":false,"size":"3421"}
        }
        else {
            isDir = 1;
            fnLen = strlen(fn);
            fsLen = 0;
            JSONstrLength += fnLen + 23 + 11;
        }
        if(psramFound()) { _JSONstr = (char*)ps_realloc(_JSONstr, JSONstrLength); }
        else             { _JSONstr = (char*)realloc(_JSONstr, JSONstrLength); }

        strcat(_JSONstr, "{\"name\":\"");
        strncat(_JSONstr, fn, fnLen);
        strcat(_JSONstr, "\",\"dir\":");
        if(isDir) { strcat(_JSONstr, "true"); }
        else      { strcat(_JSONstr, "false"); }
        if(!isDir) {
            strcat(_JSONstr, ",\"size\":");
            strncat(_JSONstr, fn + idx + 6, fsLen);
        }
        else {
            strcat(_JSONstr, ",\"size\": \"\"");
        }
        strcat(_JSONstr, "},");
    }
    _JSONstr[JSONstrLength - 2] = ']'; // replace comma by square bracket close
    return _JSONstr;
}

