schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
inline uint16_t txtlen(String str) {
    uint16_t len = 0;
    for(int32_t i = 0; i < str.length(); i++)
        if(str[i] <= 0xC2) len++;
    return len;
}

void showHeadlineVolume() {
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    tft.setFont(_fonts[1]);
    tft.setTextColor(TFT_DEEPSKYBLUE);
    clearVolume();

    uint8_t vol = 0;
    if(_f_mute || _f_muteDecrement || _f_muteIncrement) { vol = _mute_volume; }
    else { vol = _cur_volume; }

    sprintf(_chbuf, "Vol %02d", vol);
    tft.setCursor(_winVolume.x + 6, _winVolume.y + 2);
    tft.print(_chbuf);
    xSemaphoreGive(mutex_display);
}
void showHeadlineTime(bool complete) {
    static char oldtime[8];                                 // hhmmss
    char        newtime[8] = {255, 255, 255, 255, 255, 255, 255, 255};
    uint8_t     pos_s[8] = {0, 9, 17, 21, 30, 38, 41, 50};  // display 320x240
    uint8_t     pos_m[8] = {0, 13, 26, 32, 45, 58, 64, 77}; // display 480x320
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    tft.setFont(_fonts[1]);
    tft.setTextColor(TFT_GREENYELLOW);
    if(!_f_rtc) {
        xSemaphoreGive(mutex_display);
        clearTime();
        return;
    } // has rtc the correct time? no -> return
    memcpy(newtime, rtc.gettime_s(), 8);
    if(complete == true) {
        clearTime();
        for(uint8_t i = 0; i < 8; i++) { oldtime[i] = 255; }
    }
    for(uint8_t i = 0; i < 8; i++) {
        if(oldtime[i] != newtime[i]) {
            char ch[2] = {0, 0};
            ch[0] = newtime[i];
            if(TFT_CONTROLLER < 2) { // 320x240
                tft.fillRect(_winTime.x + pos_s[i], _winTime.y, 9, _winTime.h, TFT_BLACK);
                tft.setCursor(_winTime.x + pos_s[i], _winTime.y + 2);
            }
            else { // 480x320
                tft.fillRect(_winTime.x + pos_m[i], _winTime.y, 13, _winTime.h, TFT_BLACK);
                tft.setCursor(_winTime.x + pos_m[i], _winTime.y + 2);
            }
            tft.print(ch);
            oldtime[i] = newtime[i];
        }
    }

    xSemaphoreGive(mutex_display);
}
void showHeadlineItem(uint8_t idx) { // radio, clock, audioplayer...
    if(_f_sleeping) return;
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    tft.setFont(_fonts[1]);
    tft.setTextColor(TFT_GREENYELLOW);
    clearItem();
    tft.setCursor(_winItem.x + 6, _winItem.y + 2);
    tft.print(_hl_item[idx]);
    xSemaphoreGive(mutex_display);
}
void showFooterIPaddr() {
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    char myIP[30] = "myIP:";
    strcpy(myIP + 5, _myIP);
    tft.setFont(_fonts[1]);
    tft.setTextColor(TFT_GREENYELLOW);
    clearIPaddr();
    tft.setCursor(_winIPaddr.x + 6, _winIPaddr.y + 2);
    tft.print(myIP);
    xSemaphoreGive(mutex_display);
}
void showFooterStaNr() {
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    uint8_t offset = 0;
    if(TFT_CONTROLLER < 2) offset = 25;
    else
        offset = 33;
    clearStaNr();
    drawImage("/common/STA.bmp", _winStaNr.x, _winStaNr.y);
    tft.setFont(_fonts[1]);
    tft.setCursor(_winStaNr.x + offset, _winStaNr.y + 2);
    tft.setTextColor(TFT_LAVENDER);
    tft.printf("%03d", _cur_station);
    xSemaphoreGive(mutex_display);
}
void showFooterRSSI(boolean show) {
    static int32_t old_rssi = -1;
    int32_t        new_rssi = -1;
    int8_t         rssi = WiFi.RSSI(); // Received Signal Strength Indicator
    if(rssi < -1) new_rssi = 4;
    if(rssi < -50) new_rssi = 3;
    if(rssi < -65) new_rssi = 2;
    if(rssi < -75) new_rssi = 1;
    if(rssi < -85) new_rssi = 0;

    if(new_rssi != old_rssi) {
        old_rssi = new_rssi; // no need to draw a rssi icon if rssiRange has not changed
        if(ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO) {
            static int32_t tmp_rssi = 0;
            if((abs(rssi - tmp_rssi) > 3)) { SerialPrintfln("WiFI_info:   RSSI is " ANSI_ESC_CYAN "%d" ANSI_ESC_WHITE " dB", rssi); }
            tmp_rssi = rssi;
        }
        show = true;
    }
    if(show && !_timeCounter.timer) {
        switch(new_rssi) {
        case 4: {
            drawImage("/common/RSSI4.bmp", _winRSSID.x, _winRSSID.y);
            break;
        }
        case 3: {
            drawImage("/common/RSSI3.bmp", _winRSSID.x, _winRSSID.y);
            break;
        }
        case 2: {
            drawImage("/common/RSSI2.bmp", _winRSSID.x, _winRSSID.y);
            break;
        }
        case 1: {
            drawImage("/common/RSSI1.bmp", _winRSSID.x, _winRSSID.y);
            break;
        }
        case 0: {
            drawImage("/common/RSSI0.bmp", _winRSSID.x, _winRSSID.y);
            break;
        }
        }
    }
}
void showFooterBitRate(uint16_t br) {
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    clearBitRate();
    char sbr[10];
    itoa(br, sbr, 10);
    if(br < 1000) { strcat(sbr, "K"); }
    else {
        sbr[2] = sbr[1];
        sbr[1] = '.';
        sbr[3] = 'M';
        sbr[4] = '\0';
    }
    tft.setFont(_fonts[1]);
    tft.setTextColor(TFT_LAVENDER);
    uint8_t space = 6;
    if(strlen(sbr) < 4) space += 5;
    tft.setCursor(_winBitRate.x + space, _winBitRate.y + 2);
    tft.print(sbr);
    xSemaphoreGive(mutex_display);
}

void updateSleepTime(boolean noDecrement) { // decrement and show new value in footer
    if(_f_sleeping) return;
    boolean sleep = false;
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    clearSleep();
    drawImage("/common/Hourglass_blue.bmp", _winSleep.x, _winSleep.y);
    uint8_t offset = 0;
    if(TFT_CONTROLLER < 2) offset = 28;
    else
        offset = 33;
    if(_sleeptime == 1) sleep = true;
    if(_sleeptime > 0 && !noDecrement) _sleeptime--;

    char Slt[15];
    sprintf(Slt, "%d:%02d", _sleeptime / 60, _sleeptime % 60);
    tft.setFont(_fonts[1]);
    if(!_sleeptime) {
        drawImage("/common/Hourglass_blue.bmp", _winSleep.x, _winSleep.y);
        tft.setTextColor(TFT_DEEPSKYBLUE);
    }
    else {
        drawImage("/common/Hourglass_red.bmp", _winSleep.x, _winSleep.y);
        tft.setTextColor(TFT_RED);
    }
    tft.setCursor(_winSleep.x + offset, _winSleep.y + 2);
    tft.print(Slt);

    xSemaphoreGive(mutex_display);
    if(sleep) { // fall asleep
        fall_asleep();
        _sleeptime = 0;
    }
}
void showVolumeBar() {
    uint16_t val = tft.width() * getvolume() / 21;
    clearVolBar();
    tft.fillRect(_winVolBar.x, _winVolBar.y + 1, val, _winVolBar.h - 2, TFT_RED);
    tft.fillRect(val + 1, _winVolBar.y + 1, tft.width() - val + 1, _winVolBar.h - 2, TFT_GREEN);
    _f_volBarVisible = true;
}

void updateVUmeter() {
    if(_state != RADIO) return;
    if(_f_state_isChanging) return;
    if(_f_sleeping) return;
    if(_f_irNumberSeen) return;
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    uint8_t width = 0, height = 0, xOffs = 0, yOffs = 0, xStart = 0, yStart = 0;
#if TFT_CONTROLLER < 2 // 320 x 240px
    width = 9;
    height = 7;
    xOffs = 11;
    yOffs = 8;
    xStart = 2;
    yStart = 90;
#else // 480 x 320px
    width = 12;
    height = 8;
    xOffs = 16;
    yOffs = 10;
    xStart = 2;
    yStart = 115;
#endif

