schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
    // c99 has no inner functions, lambdas are only allowed from c11, please don't use ancient compiler
    auto drawRect = [&](uint8_t pos, uint8_t ch, bool br) { // lambda, inner function
        uint16_t color = 0, xPos = _winVUmeter.x + xStart + ch * xOffs, yPos = _winVUmeter.y + yStart - pos * yOffs;
        if(pos > 11) return;
        switch(pos) {
        case 0 ... 6: // green
            br ? color = TFT_GREEN : color = TFT_DARKGREEN;
            break;
        case 7 ... 9: // yellow
            br ? color = TFT_YELLOW : color = TFT_DARKYELLOW;
            break;
        case 10 ... 11: // red
            br ? color = TFT_RED : color = TFT_DARKRED;
            break;
        }
        tft.fillRect(xPos, yPos, width, height, color);
    };

    uint16_t vum = audioGetVUlevel();

    uint8_t left = map_l(vum >> 8, 0, 127, 0, 11);
    uint8_t right = map_l(vum & 0x00FF, 0, 127, 0, 11);

    if(left > _VUleftCh) {
        for(int32_t i = _VUleftCh; i < left; i++) { drawRect(i, 1, 1); }
    }
    if(left < _VUleftCh) {
        for(int32_t i = left; i < _VUleftCh; i++) { drawRect(i, 1, 0); }
    }
    _VUleftCh = left;

    if(right > _VUrightCh) {
        for(int32_t i = _VUrightCh; i < right; i++) { drawRect(i, 0, 1); }
    }
    if(right < _VUrightCh) {
        for(int32_t i = right; i < _VUrightCh; i++) { drawRect(i, 0, 0); }
    }
    _VUrightCh = right;
    xSemaphoreGive(mutex_display);
}

void showBrightnessBar() {
    uint16_t val = tft.width() * getBrightness() / 100;
    clearVolBar();
    tft.fillRect(_winVolBar.x, _winVolBar.y + 1, val, _winVolBar.h - 2, TFT_RED);
    tft.fillRect(val + 1, _winVolBar.y + 1, tft.width() - val + 1, _winVolBar.h - 2, TFT_GREEN);
    _f_volBarVisible = true;
}
void showFooter() { // stationnumber, sleeptime, IPaddress
    showFooterStaNr();
    updateSleepTime(true);
    showFooterIPaddr();
    showFooterRSSI(true);
    showFooterBitRate(_icyBitRate);
}
void display_info(const char* str, int32_t xPos, int32_t yPos, uint16_t color, uint16_t margin_l, uint16_t margin_r, uint16_t winWidth, uint16_t winHeight) {
    tft.fillRect(xPos, yPos, winWidth, winHeight, TFT_BLACK); // Clear the space for new info
    tft.setTextColor(color);                                  // Set the requested color
    tft.setCursor(xPos + margin_l, yPos);                     // Prepare to show the info
    // SerialPrintfln("cursor x=%d, y=%d, winHeight=%d", xPos+indent, yPos, winHeight);
    uint16_t ch_written = tft.writeText((const uint8_t*)str, winWidth - margin_r, winHeight);
    if(ch_written < strlenUTF8(str)) {
        // If this message appears, there is not enough space on the display to write the entire text,
        // a part of the text has been cut off
        SerialPrintfln("txt overflow, winHeight=" ANSI_ESC_CYAN "%d" ANSI_ESC_WHITE ", strlen=" ANSI_ESC_CYAN "%d" ANSI_ESC_WHITE
                       ", written=" ANSI_ESC_CYAN "%d" ANSI_ESC_WHITE ", str=" ANSI_ESC_CYAN "%s",
                       winHeight, strlenUTF8(str), ch_written, str);
    }
}
void showStreamTitle(const char* streamtitle) {
    if(_f_sleeping) return;
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    String ST = streamtitle;

    ST.trim();               // remove all leading or trailing whitespaces
    ST.replace(" | ", "\n"); // some stations use pipe as \n or
    ST.replace("| ", "\n");  // or
    ST.replace("|", "\n");
    switch(strlenUTF8(ST.c_str())) {
    case 0 ... 30: tft.setFont(_fonts[5]); break;
    case 31 ... 43: tft.setFont(_fonts[4]); break;
    case 44 ... 65: tft.setFont(_fonts[3]); break;
    case 66 ... 130: tft.setFont(_fonts[2]); break;
    case 131 ... 200: tft.setFont(_fonts[1]); break;
    default: tft.setFont(_fonts[0]); break;
    }
    display_info(ST.c_str(), _winSTitle.x, _winSTitle.y, TFT_CORNSILK, 5, 5, _winSTitle.w, _winSTitle.h);
    xSemaphoreGive(mutex_display);
}
void showVUmeter() {
    if(_f_sleeping) return;
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    drawImage("/common/level_bar.jpg", _winVUmeter.x, _winVUmeter.y);
    _VUrightCh = 0;
    _VUleftCh = 0;
    xSemaphoreGive(mutex_display);
}

void showLogoAndStationName() {
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    clearLogoAndStationname();
    xSemaphoreGive(mutex_display);
    String SN_utf8 = "";
    if(_cur_station) { SN_utf8 = _stationName_nvs; }
    else { SN_utf8 = _stationName_air; }
    SN_utf8.trim();

    showStationName(SN_utf8);

    showStationLogo(SN_utf8);
}

void showStationName(String sn) {
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    switch(strlenUTF8(sn.c_str())) {
    case 0 ... 20: tft.setFont(_fonts[5]); break;
    case 21 ... 32: tft.setFont(_fonts[4]); break;
    case 33 ... 45: tft.setFont(_fonts[3]); break;
    case 46 ... 60: tft.setFont(_fonts[2]); break;
    case 61 ... 90: tft.setFont(_fonts[1]); break;
    default: tft.setFont(_fonts[0]); break;
    }
    display_info(sn.c_str(), _winName.x, _winName.y, TFT_CYAN, 10, 0, _winName.w, _winName.h);
    xSemaphoreGive(mutex_display);
}

void showStationLogo(String ln) {
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    String logo = "/logo/" + (String)ln.c_str() + ".jpg";
    if(drawImage(logo.c_str(), 0, _winName.y + 2) == false) {
        drawImage("/common/unknown.jpg", 0, _winName.y + 2); // if no draw unknown
        _f_logoUnknown = true;
    }
    xSemaphoreGive(mutex_display);
}

void showFileLogo(uint8_t state) {
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    String logo;
    if(state == RADIO) {
        if(endsWith(_stationURL, "m3u8")) logo = "/common/" + (String) "M3U8" + ".jpg";
        else
            logo = "/common/" + (String)codecname[_cur_Codec] + ".jpg";
    }
    else if(state == DLNA)  { logo = "/common/DLNA.jpg"; }
    else if(state == PLAYER){ logo = "/common/AudioPlayer.jpg";}
    else { // _state PLAYER or PLAYERico
        logo = "/common/" + (String)codecname[_cur_Codec] + ".jpg";
    }
    if(drawImage(logo.c_str(), 0, _winName.y + 2) == true) { webSrv.send("stationLogo=" + logo); }
    else {
        (drawImage("/common/unknown.jpg", 0, _winName.y + 2));
        webSrv.send("stationLogo=");
    }
    xSemaphoreGive(mutex_display);
}

void showFileName(const char* fname) {
    if(!fname) return;
    switch(strlenUTF8(fname)) {
    case 0 ... 15: tft.setFont(_fonts[5]); break;
    case 16 ... 30: tft.setFont(_fonts[4]); break;
    case 31 ... 70: tft.setFont(_fonts[3]); break;
    case 71 ... 100: tft.setFont(_fonts[2]); break;
    case 101 ... 150: tft.setFont(_fonts[1]); break;
    default: tft.setFont(_fonts[0]); break;
    }
    display_info(fname, _winName.x, _winName.y, TFT_CYAN, 0, 0, _winName.w, _winName.h);
}

void showFileNumber(){
    tft.setFont(_fonts[3]);
    char buf[15];
    if(_f_playlistEnabled){
        sprintf(buf, "%03u/%03u", _plsMaxEntries - _plsEntries + 1, _plsMaxEntries);
        display_info(buf, _winFileNr.x, _winFileNr.y, TFT_ORANGE, 10, 0, _winFileNr.w, _winFileNr.h);
    }
    else{
        if(!_f_shuffle) {sprintf(buf, "%03u/%03u", (unsigned int)_cur_AudioFileNr + 1, (unsigned int)_audioFilesInList);}
        else            {sprintf(buf, "%03u/%03u", _shuffleArray[_cur_AudioFileNr] + 1, _audioFilesInList);}
        display_info(buf, _winFileNr.x, _winFileNr.y, TFT_DEEPSKYBLUE, 10, 0, _winFileNr.w, _winFileNr.h);
    }
}

