schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
void showStationsList(uint16_t staListNr){
    clearWithOutHeaderFooter();
    if(_sum_stations < 11) staListNr = 0;
    else if(staListNr + 9 > _max_stations) staListNr = _max_stations - 9;
    showHeadlineItem(STATIONSLIST);
    tft.setFont(_fonts[1]);
    uint8_t lineHight = _winWoHF.h / 10;
    for(uint8_t pos = 0; pos < 10; pos++){
        if(pos + staListNr + 1 > _sum_stations) break;
        tft.setCursor(10, _winFooter.h + (pos) * lineHight) ;
        sprintf(_chbuf, "station_%03d", pos + staListNr  + 1);
        String content = stations.getString(_chbuf, " #not_found");
        content.replace('#','\0');
        sprintf(_chbuf, ANSI_ESC_YELLOW"%03d " ANSI_ESC_WHITE "%s\n",pos + staListNr  + 1, content.c_str());
        tft.writeText((uint8_t*)_chbuf, -1, -1, true);
    }
    _timeCounter.timer = 10;
    _timeCounter.factor = 1.0;
}


void display_time(boolean showall) { // show current time on the TFT Display
    static String  t, oldt = "";
    static boolean k = false;
    uint8_t        i = 0;
    if(showall == true) { oldt = "        ";}
    if((_state == CLOCK) || (_state == CLOCKico)) {
        if(_timeFormat == 12) t = rtc.gettime_xs_12h(); // 01:27 PM
        else                  t = rtc.gettime_xs();     // 13:27

        for(i = 0; i < 5; i++) {
            if(t[i] == ':') {
                if(k == false) {
                    k = true;
                    t[i] = 'd';
                }
                else {
                    t[i] = 'e';
                    k = false;
                }
            }
            if(_timeFormat == 12){
                if(t[i] != oldt[i]) {
                    sprintf(_chbuf, "/digits/foldedNumbers/%cwhite.jpg", t[i]);
                    drawImage(_chbuf, _alarmtimeXPosFN[i], _winDigits.y);
                    if(i == 4){
                        if(t.substring(6,8) == "PM"){
                            drawImage("/digits/foldedNumbers/pmwhite.jpg", _alarmtimeXPosFN[5], _winDigits.y);
                        }
                        else{
                            drawImage("/digits/foldedNumbers/amwhite.jpg", _alarmtimeXPosFN[5], _winDigits.y);
                        }
                    }
                }
            }
            else{
                if(t[i] != oldt[i]) { // 24h representation
                    sprintf(_chbuf, "/digits/sevenSegment/%cgreen.jpg", t[i]);
                    drawImage(_chbuf, _alarmtimeXPos7S[i], _winDigits.y);
                }
            }
        }
        oldt = t;
    }
}

void display_alarmDays(uint8_t ad, boolean showall) { // Sun ad=0, Mon ad=1, Tue ad=2 ....
    uint8_t i = 0;
    String  str = "";

    if(!showall) _alarmdays ^= (1 << ad); // toggle bit

    for(i = 0; i < 7; i++) {
        str = "/day/" + String(i);
        if(_alarmdays & (1 << i)) str += "_rt_en.bmp"; // l << i instead pow(2,i)
        else
            str += "_gr_en.bmp";
        drawImage(str.c_str(), _alarmdaysXPos[i], _winAlarmDays.y);
    }
}

void display_alarmtime(int8_t xy, int8_t ud, boolean showall) {
    static int8_t pos, h, m;
    int8_t        updatePos = -1, oldPos = -1;

    if(showall) {
        h = _alarmtime / 60;
        m = _alarmtime % 60;
    }

    if(ud == 1) {
        if(pos == 0)
            if(((h / 10) == 1 && (h % 10) < 4) || ((h / 10) == 0)) {
                h += 10;
                updatePos = 0;
            }
        if(pos == 1)
            if(((h / 10) == 2 && (h % 10) < 3) || ((h / 10) < 2 && (h % 10) < 9)) {
                h++;
                updatePos = 1;
            }
        if(pos == 2)
            if((m / 10) < 5) {
                m += 10;
                updatePos = 2;
            }
        if(pos == 3)
            if((m % 10) < 9) {
                m++;
                updatePos = 3;
            }
        _alarmtime = h * 60 + m;
    }
    if(ud == -1) {
        if(pos == 0)
            if((h / 10) > 0) {
                h -= 10;
                updatePos = 0;
            }
        if(pos == 1)
            if((h % 10) > 0) {
                h--;
                updatePos = 1;
            }
        if(pos == 2)
            if((m / 10) > 0) {
                m -= 10;
                updatePos = 2;
            }
        if(pos == 3)
            if((m % 10) > 0) {
                m--;
                updatePos = 3;
            }
        _alarmtime = h * 60 + m;
    }

    if(xy == 1) {
        oldPos = pos++;
        if(pos == 4) pos = 0;
        updatePos = pos; // pos 0...3 only
    }
    if(xy == -1) {
        oldPos = pos--;
        if(pos == -1) pos = 3;
        updatePos = pos;
    }

    char hhmm[15];
    sprintf(hhmm, "%d%d%d%d", h / 10, h % 10, m / 10, m % 10);

    if(showall) {
        drawImage("/digits/sevenSegment/dred.jpg", _alarmtimeXPos7S[2], _winDigits.y); // colon
    }

    for(uint8_t i = 0; i < 4; i++) {
        uint8_t p = i;
        if(i > 1) p++; // skip colon
        strcpy(_path, "/digits/sevenSegment/");
        strncat(_path, (const char*)hhmm + i, 1);
        if(showall) {
            if(i == pos) strcat(_path, "orange.jpg"); // show orange number
            else
                strcat(_path, "red.jpg");          // show red numbers

            drawImage(_path, _alarmtimeXPos7S[p], _winDigits.y);
        }

        else {
            if(i == updatePos) {
                strcat(_path, "orange.jpg");
                drawImage(_path, _alarmtimeXPos7S[p], _winDigits.y);
            }
            if(i == oldPos) {
                strcat(_path, "red.jpg");
                drawImage(_path, _alarmtimeXPos7S[p], _winDigits.y);
            }
        }
    }
}

void display_sleeptime(int8_t ud) { // set sleeptimer
    if(ud == 1) {
        switch(_sleeptime) {
        case 0 ... 14: _sleeptime = (_sleeptime / 5) * 5 + 5; break;
        case 15 ... 59: _sleeptime = (_sleeptime / 15) * 15 + 15; break;
        case 60 ... 359: _sleeptime = (_sleeptime / 60) * 60 + 60; break;
        default: _sleeptime = 360; break; // max 6 hours
        }
    }
    if(ud == -1) {
        switch(_sleeptime) {
        case 1 ... 15: _sleeptime = ((_sleeptime - 1) / 5) * 5; break;
        case 16 ... 60: _sleeptime = ((_sleeptime - 1) / 15) * 15; break;
        case 61 ... 360: _sleeptime = ((_sleeptime - 1) / 60) * 60; break;
        default: _sleeptime = 0; break; // min
        }
    }
    char tmp[10];
    sprintf(tmp, "%d%02d", _sleeptime / 60, _sleeptime % 60);
    char path[128] = "/digits_small/";

    for(uint8_t i = 0; i < 4; i++) {
        strcpy(path, "/digits_small/");
        if(i == 3) {
            if(!_sleeptime) strcat(path, "dsgn.jpg");
            else
                strcat(path, "dsrt.jpg");
        }
        else {
            strncat(path, (tmp + i), 1);
            if(!_sleeptime) strcat(path, "sgn.jpg");
            else
                strcat(path, "srt.jpg");
        }
        drawImage(path, _sleeptimeXPos[i], 48);
    }
}

boolean drawImage(const char* path, uint16_t posX, uint16_t posY, uint16_t maxWidth, uint16_t maxHeigth) {
    const char* scImg = scaleImage(path);
    if(!SD_MMC.exists(scImg)) {
        if(indexOf(scImg, "/.", 0) > 0) return false; // empty filename
        SerialPrintfln("AUDIO_info:  " ANSI_ESC_RED "file \"%s\" not found", scImg);
        return false;
    }
    if(endsWith(scImg, "bmp")) {
        return tft.drawBmpFile(SD_MMC, scImg, posX, posY, maxWidth, maxHeigth);
    }
    if(endsWith(scImg, "jpg")) {
        return tft.drawJpgFile(SD_MMC, scImg, posX, posY, maxWidth, maxHeigth);
    }
    if(endsWith(scImg, "gif")) {
        return tft.drawGifFile(SD_MMC, scImg, posX, posY, 0);
    }

