schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
    SerialPrintfln(ANSI_ESC_RED "the file \"%s\" contains neither a bmp, a gif nor a jpj graphic", scImg);
    return false; // neither jpg nor bmp
}
/*****************************************************************************************************************************************************
 *                                                   H A N D L E  A U D I O F I L E                                                                  *
 *****************************************************************************************************************************************************/
bool SD_listDir(const char* path, boolean audioFilesOnly, boolean withoutDirs){ // sort the content of an given directory and lay it in the
    File file;                                                                  // vector _SD_content, add to filename ANSI_ESC_YELLOW and file size
    vector_clear_and_shrink(_SD_content);
    _audioFilesInList = 0;
    if(audioFile) audioFile.close();
    if(!SD_MMC.exists(path)){
        SerialPrintfln(ANSI_ESC_RED "SD_MMC/%s not exist", path);
        return false;
    }
    audioFile = SD_MMC.open(path);
    if(!audioFile.isDirectory()) {
        SerialPrintfln(ANSI_ESC_RED "SD_MMC/%s is not a directory", path);
        audioFile.close();
        return false;
    }
    while(true) {    // get content
        file = audioFile.openNextFile();
        if(!file) break;
        if(file.isDirectory()){
            if(!withoutDirs){
                _chbuf[0] = 2; // ASCII: start of text, sort set dirs on first position
                sprintf(_chbuf + 1, "%s", file.name());
                _SD_content.push_back(x_ps_strdup((const char*)_chbuf));
            }
        }
        else {
            if(audioFilesOnly){
                if(endsWith(file.name(), ".mp3") || endsWith(file.name(), ".aac") || endsWith(file.name(), ".m4a") || endsWith(file.name(), ".wav") ||
                    endsWith(file.name(), ".flac") || endsWith(file.name(), ".m3u") || endsWith(file.name(), ".opus") || endsWith(file.name(), ".ogg")) {
                        sprintf(_chbuf, "%s" ANSI_ESC_YELLOW " %d", file.name(), file.size());
                        _SD_content.push_back(x_ps_strdup((const char*) _chbuf));
                }
            }
            else{
                sprintf(_chbuf, "%s" ANSI_ESC_YELLOW " %d", file.name(), file.size());
                _SD_content.push_back(x_ps_strdup((const char*) _chbuf));
            }
        }
        if(isAudio(file)) _audioFilesInList++;
        if(endsWith(file.name(), ".m3u")) _audioFilesInList++;
    }
    for(int i = 0; i < _SD_content.size(); i++){  // easy bubble sort
        for(int j = 1; j < _SD_content.size(); j++){
            if(strcmp(_SD_content[j - 1], _SD_content[i]) > 0){
                swap(_SD_content[i], _SD_content[j - 1]);
            }
        }
    }
    for(int i = 0; i < _SD_content.size(); i++){
        if(_SD_content[i][0] == 2){ // remove ASCII 2
            memcpy(_SD_content[i], _SD_content[i] + 1, strlen(_SD_content[i]));
        }
    }
    audioFile.close();
    return true;
}

void showAudioFilesList(uint16_t fileListNr){ // on tft
    clearWithOutHeaderFooter();
    if(_SD_content.size() < 10) fileListNr = 0;
    showHeadlineItem(AUDIOFILESLIST);
    tft.setCursor(10, _winFooter.h) ;
    tft.setTextColor(TFT_ORANGE);
    tft.writeText((uint8_t*)_curAudioFolder.c_str(), -1,-1, true);
    tft.setTextColor(TFT_WHITE);
    tft.setFont(_fonts[1]);
    uint8_t lineHight = _winWoHF.h / 10;
    for(uint8_t pos = 1; pos < 10; pos++){
        if(pos == 1 && fileListNr > 0){
            tft.setCursor(0, _winFooter.h + (pos) * lineHight);
            tft.setTextColor(TFT_AQUAMARINE);
            tft.writeText((uint8_t*)"˄");
        }
        if(pos == 9 && fileListNr + 9 < _SD_content.size()){
            tft.setCursor(0, _winFooter.h + (pos) * lineHight);
            tft.setTextColor(TFT_AQUAMARINE);
            tft.writeText((uint8_t*)"˅");
        }
        if(fileListNr + pos > _SD_content.size()) break;
        tft.setCursor(20, _winFooter.h + (pos) * lineHight);
        if(indexOf(_SD_content[pos + fileListNr - 1 ], "\033[", 0) == -1) tft.setTextColor(TFT_GRAY); // is folder
        else tft.setTextColor(TFT_WHITE);                                                     // is file
        tft.writeText((uint8_t*)_SD_content[pos + fileListNr - 1 ], -1, -1, true);
    }
    _timeCounter.timer = 10;
    _timeCounter.factor = 1.0;
}

boolean isAudio(File file){
    if(endsWith(file.name(), ".mp3") || endsWith(file.name(), ".aac") || endsWith(file.name(), ".m4a") || endsWith(file.name(), ".wav") ||
               endsWith(file.name(), ".flac") || endsWith(file.name(), ".opus") || endsWith(file.name(), ".ogg")){
        return true;
    }
    return false;
}

boolean isAudio(const char* path){
    if(endsWith(path, ".mp3") || endsWith(path, ".aac") || endsWith(path, ".m4a") || endsWith(path, ".wav") ||
               endsWith(path, ".flac") || endsWith(path, ".opus") || endsWith(path, ".ogg")){
        return true;
    }
    return false;
}

boolean isPlaylist(File file){
    if(endsWith(file.name(), ".m3u")){
        return true;
    }
    return false;
}

void processPlaylist(boolean first) {
    static uint16_t idx = 0;
    boolean f_has_EXTINF = false;
    if(first){
        boolean f_EXTINF_seen = false;
        _plsEntries = 0;
        idx = 0;
        vector_clear_and_shrink(_PLS_content);
        while(playlistFile.available() > 0) {
            size_t bytesRead = playlistFile.readBytesUntil('\n', _chbuf, 511);
            if(bytesRead < 5) continue; // line is # or space or nothing, smallest filename "1.mp3" < 5
            _chbuf[bytesRead] = '\0';
            trim(_chbuf);
            if(startsWith(_chbuf, "#EXTM3U")) continue;
            if(startsWith(_chbuf, "#EXTINF")) {_PLS_content.push_back(x_ps_strdup((const char*)_chbuf)); f_EXTINF_seen = true; continue;}
            if(startsWith(_chbuf, "http"))    {_PLS_content.push_back(x_ps_strdup((const char*)_chbuf)); f_EXTINF_seen = false; _plsEntries++; continue;}
            if(isAudio(_chbuf))               {_PLS_content.push_back(x_ps_strdup((const char*)_chbuf)); f_EXTINF_seen = false; _plsEntries++; continue;}
            if(f_EXTINF_seen == true) {_PLS_content.pop_back(); f_EXTINF_seen = false;}
            continue;
        }
        for(int i = 0; i < _PLS_content.size(); i++){
            strcpy(_chbuf, _PLS_content[i]);
            urldecode(_chbuf);
            SerialPrintfln("Playlist:    " ANSI_ESC_GREEN "%s", _chbuf);
        }
        if(_plsEntries == 0) return;
        _f_playlistEnabled = true;
        _plsMaxEntries = _plsEntries;
    }

    if(!_plsEntries) goto exit;

    // now read from vector _PLS_content

