schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
    strcpy(_chbuf, _PLS_content[idx]);
    if(startsWith(_chbuf, "#EXTINF")) {
        f_has_EXTINF = true;
        int8_t idx1 = indexOf(_chbuf, ":", 0) + 1;
        int8_t idx2 = indexOf(_chbuf, ",", 0);
        SerialPrintfln("Playlist:    " ANSI_ESC_GREEN "Title: %s", _chbuf + idx2 + 1);
        clearLogo();
        showFileName(_chbuf + idx2 + 1);
        int8_t len = idx2 - idx1;
        if(len > 0 && len < 6) { // song playtime
            char tmp[7];
            memcpy(tmp, _chbuf + idx1, len);
            tmp[len] = '\0';
            SerialPrintfln("Playlist:    " ANSI_ESC_GREEN "playtime: %is", atoi(tmp));
        }
        idx++;
        strcpy(_chbuf, _PLS_content[idx]);
    }

    _f_playlistNextFile = false;
    if(startsWith(_chbuf, "http")) {
        SerialPrintflnCut("Playlist:    ", ANSI_ESC_YELLOW, _chbuf);
        showVolumeBar();
        if(!f_has_EXTINF) clearLogoAndStationname();
        f_has_EXTINF = false;
        webSrv.send((String) "SD_playFile=" + _chbuf);
        changeState(PLAYERico);
        _cur_Codec = 0;
        _f_isWebConnected = audioConnecttohost(_chbuf);
        _f_isFSConnected = false;
        showFileNumber();
    }
    else {
        const char* path = playlistFile.path();
        int32_t         idx = lastIndexOf(path, '/');
        int32_t         len = strlen(_chbuf);
        for(int32_t i = len; i > -1; i--) { _chbuf[idx + i + 1] = _chbuf[i]; }
        strncpy(_chbuf, path, idx + 1);
        // log_w("pls path %s, %i, %i", _chbuf, idx, len);
        urldecode(_chbuf);
        SerialPrintfln("Playlist:    " ANSI_ESC_YELLOW "%s", _chbuf);
        webSrv.send((String) "SD_playFile=" + _chbuf);
        if(!f_has_EXTINF) {SD_playFile(_chbuf);}
        else              {f_has_EXTINF = false; SD_playFile(_chbuf, 0, false);}
    }

    idx++;
    _plsEntries--;
    return;

exit:
    playlistFile.close();
    _plsMaxEntries = 0;
    SerialPrintfln("Playlist:    " ANSI_ESC_BLUE "end of playlist");
    webSrv.send("SD_playFile=end of playlist");
    _f_playlistEnabled = false;
    changeState(PLAYER);
    return;
}
/*****************************************************************************************************************************************************
 *                                         C O N N E C T   TO   W I F I     /     A C C E S S P O I N T                                              *
 *****************************************************************************************************************************************************/
bool connectToWiFi() {
    String s_ssid = "", s_password = "", s_info = "";
    wifiMulti.addAP(_SSID, _PW);                        // SSID and PW in code
    if(pref.isKey("ap_ssid") && pref.isKey("ap_pw")) {  // exists?
        String ap_ssid = pref.getString("ap_ssid", ""); // credentials from accesspoint
        String ap_pw = pref.getString("ap_pw", "");
        if(ap_ssid.length() > 0 && ap_pw.length() > 0) wifiMulti.addAP(ap_ssid.c_str(), ap_pw.c_str());
    }
    WiFi.setHostname("MiniWebRadio");
    if(psramFound()) WiFi.useStaticBuffers(true);
    File file = SD_MMC.open("/networks.csv"); // try credentials given in "/networks.txt"
    if(file) {                                // try to read from SD_MMC
        String str = "";
        while(file.available()) {
            str = file.readStringUntil('\n');   // read the line
            if(str[0] == '*') continue;         // ignore this, goto next line
            if(str[0] == '\n') continue;        // empty line
            if(str[0] == ' ') continue;         // space as first char
            if(str.indexOf('\t') < 0) continue; // no tab
            str += "\t";
            uint p = 0, q = 0;
            s_ssid = "", s_password = "", s_info = "";
            for(int32_t i = 0; i < str.length(); i++) {
                if(str[i] == '\t') {
                    if(p == 0) s_ssid = str.substring(q, i);
                    if(p == 1) s_password = str.substring(q, i);
                    if(p == 2) s_info = str.substring(q, i);
                    p++;
                    i++;
                    q = i;
                }
            }
            // log_i("s_ssid=%s  s_password=%s  s_info=%s", s_ssid.c_str(), s_password.c_str(), s_info.c_str());
            if(s_ssid == "") continue;
            if(s_password == "") continue;
            wifiMulti.addAP(s_ssid.c_str(), s_password.c_str());
        }
        file.close();
    }
    wifiMulti.run();

    if(WiFi.isConnected()) {
        SerialPrintfln("WiFI_info:   Connecting WiFi...");
        WiFi.setSleep(false);
        if(!MDNS.begin("MiniWebRadio")) {
            SerialPrintfln("WiFI_info:   " ANSI_ESC_YELLOW "Error starting mDNS");
        }
        else{
            MDNS.addService("esp32", "tcp", 80);
            SerialPrintfln("WiFI_info:   mDNS name: " ANSI_ESC_CYAN "MiniWebRadio");
        }
        return true;
    }
    else {
        SerialPrintfln("WiFI_info:   " ANSI_ESC_RED "WiFi credentials are not correct");
        return false; // can't connect to any network
    }
}

void openAccessPoint() { // if credentials are not correct open AP at 192.168.4.1
    clearAll();
    tft.setFont(_fonts[4]);
    tft.setTextColor(TFT_YELLOW);
    tft.setCursor(25, 80);
    setTFTbrightness(80);
    _f_accessPoint = true;
    WiFi.mode(WIFI_STA);
    WiFi.disconnect();
    WiFi.softAP("MiniWebRadio");
    IPAddress myIP = WiFi.softAPIP();
    String    AccesspointIP = myIP.toString();
    tft.printf("WiFi credentials are not correct\nAccesspoint IP: %s", AccesspointIP.c_str());
    SerialPrintfln("Accesspoint: " ANSI_ESC_RED "IP: %s", AccesspointIP.c_str());
    int16_t n = WiFi.scanNetworks();
    if(n == 0) {
        SerialPrintfln("setup: ....  no WiFi networks found");
        while(true) { ; }
    }
    else {
        SerialPrintfln("setup: ....  %d WiFi networks found", n);
        for(int32_t i = 0; i < n; ++i) {
            SerialPrintfln("setup: ....  " ANSI_ESC_GREEN "%s (%d)", WiFi.SSID(i).c_str(), (int16_t)WiFi.RSSI(i));
            _scannedNetworks += WiFi.SSID(i) + '\n';
        }
    }
    webSrv.begin(80, 81); // HTTP port, WebSocket port
    return;
}

