schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
const char* scaleImage(const char* path) {
    if((!endsWith(path, "bmp")) && (!endsWith(path, "jpg")) && (!endsWith(path, "gif"))) { // not a image
        return path;
    }
    static char pathBuff[256];
    memset(pathBuff, 0, sizeof(pathBuff));
    char* pch = strstr(path + 1, "/");
    if(pch) {
        strncpy(pathBuff, path, (pch - path));
        strcat(pathBuff, _prefix);
        strcat(pathBuff, pch);
    }
    else {
        return path; // invalid path
    }
    return pathBuff;
}

void xchgShuffle(uint16_t n) {// generates a uint8_t array of length n with {0, 1, 2, ... n} and shuffles it
    if(_shuffleArray){free(_shuffleArray); _shuffleArray = NULL;}
    if(!n)return;
    _shuffleArray = (uint16_t*)malloc(n * sizeof(uint16_t));
    for(uint16_t i = 0; i < n; i++){
        _shuffleArray[i] = i;
    }

    for(uint16_t i = 0; i < n; i++){ // and now shuffle
        uint16_t randIndex1 = random( 0, n);
        uint16_t randIndex2 = random( 0, n);
        uint16_t temp = _shuffleArray[randIndex1];
        _shuffleArray[randIndex1] = _shuffleArray[randIndex2];  //swapping the values
        _shuffleArray[randIndex2] = temp;                       //swapping the values
    }
}

inline uint8_t getvolume() { return _cur_volume; }
void           setVolume(uint8_t vol) {
    if(_f_mute == false) {
        audioSetVolume(vol);
        showHeadlineVolume();
    }
    else { showHeadlineVolume(); }
    _cur_volume = vol;
    SerialPrintfln("action: ...  current volume is " ANSI_ESC_CYAN "%d", _cur_volume);

#if DECODER > 1 // ES8388, AC101 ...
    if(HP_DETECT == -1) {
        dac.SetVolumeSpeaker(_cur_volume * 3);
        dac.SetVolumeHeadphone(_cur_volume * 3);
    }
    else {
        if(digitalRead(HP_DETECT) == HIGH) {
            // SerialPrintfln("HP_Detect = High, volume %i", vol);
            dac.SetVolumeSpeaker(_cur_volume * 3);
            dac.SetVolumeHeadphone(0);
        }
        else {
            // SerialPrintfln("HP_Detect = Low, volume %i", vol);
            dac.SetVolumeSpeaker(1);
            dac.SetVolumeHeadphone(_cur_volume * 3);
        }
    }
#endif
}

uint8_t downvolume() {
    if(_cur_volume == 0) return _cur_volume;
    _cur_volume--;
    setVolume(_cur_volume);
    return _cur_volume;
}
uint8_t upvolume() {
    if(_cur_volume == _max_volume) return _cur_volume;
    _cur_volume++;
    setVolume(_cur_volume);
    return _cur_volume;
}
inline void mute() {
    if(_f_mute == false) {
        _f_muteDecrement = true;
        _f_muteIncrement = false;
    }
    else {
        _f_muteIncrement = true;
        _f_muteDecrement = false;
        if(AMP_ENABLED != -1) digitalWrite(AMP_ENABLED, HIGH);
    }
}

void setStation(uint16_t sta) {
    // SerialPrintfln("sta %d, _cur_station %d", sta, _cur_station );
    if(sta == 0) return;
    if(sta > _sum_stations) sta = _cur_station;
    sprintf(_chbuf, "station_%03d", sta);
    String content = stations.getString(_chbuf, " #not_found");
//    SerialPrintfln("content %s", content.c_str());
    _stationName_nvs = content.substring(0, content.indexOf("#"));           // get stationname
    content = content.substring(content.indexOf("#") + 1, content.length()); // get URL
    content.trim();
    free(_stationURL);
    _stationURL = x_ps_strdup(content.c_str());
    _homepage = "";
    if(_state == RADIO) clearStreamTitle();

    SerialPrintfln("action: ...  switch to station " ANSI_ESC_CYAN "%d", sta);

    if(_f_isWebConnected && sta == _cur_station && _state == RADIO) { // Station is already selected
        _f_newStreamTitle = true;
    }
    else {
        _streamTitle[0] = '\0';
        _icyDescription[0] = '\0';
        _f_newStreamTitle = true;
        _f_newIcyDescription = true;
        connecttohost(_stationURL);
    }
    _cur_station = sta;
    StationsItems();
    if(_state == RADIO || _state == RADIOico) showLogoAndStationName();
    showFooterStaNr();
}
void nextStation() {
    if(_cur_station >= _sum_stations) setStation(1);
    else
        setStation(_cur_station + 1);
}
void prevStation() {
    if(_cur_station > 1) setStation(_cur_station - 1);
    else
        setStation(_sum_stations);
}

void StationsItems() {
    if(_cur_station > 0) {
        webSrv.send("stationLogo=/logo/" + _stationName_nvs + ".jpg");
        webSrv.send("stationNr=" + String(_cur_station));
        webSrv.send("stationURL=" + String(_stationURL));
    }
    else {
        webSrv.send("stationLogo=/logo/" + _stationName_air + ".jpg");
        webSrv.send("stationNr=" + String(_cur_station));
        //    webSrv.send("stationURL=" + _lastconnectedhost);
    }
}

void setStationViaURL(const char* url) {
    _stationName_air = "";
    _stationName_nvs = "";
    _cur_station = 0;
    free(_stationURL);
    _stationURL = x_ps_strdup(url);
    connecttohost(url);
    StationsItems();
    if(_state == RADIO || _state == RADIOico){
        clearStreamTitle();
        showLogoAndStationName();
    }
    showFooterStaNr(); // set to '000'
}

void changeBtn_pressed(uint8_t btnNr) { drawImage(_pressBtn[btnNr], btnNr * _winButton.w, _winButton.y); }
void changeBtn_released(uint8_t btnNr) {
    if(_state == RADIOico || _state == PLAYERico) {
        if(_f_mute) _releaseBtn[0] = "/btn/Button_Mute_Red.jpg";
        else
            _releaseBtn[0] = "/btn/Button_Mute_Green.jpg";
    }
    if(_state == CLOCKico) {
        if(_f_mute) _releaseBtn[2] = "/btn/Button_Mute_Red.jpg";
        else
            _releaseBtn[2] = "/btn/Button_Mute_Green.jpg";
    }
    drawImage(_releaseBtn[btnNr], btnNr * _winButton.w, _winButton.y);
}

void savefile(const char* fileName, uint32_t contentLength) { // save the uploadfile on SD_MMC
    char fn[256];

    if(!_f_SD_Upload && endsWith(fileName, "jpg")) {
        strcpy(fn, "/logo");
        strcat(fn, _prefix);
        if(!startsWith(fileName, "/")) strcat(fn, "/");
        strcat(fn, fileName);
        if(webSrv.uploadB64image(SD_MMC, fn, contentLength)) {
            SerialPrintfln("save image " ANSI_ESC_CYAN "%s" ANSI_ESC_WHITE " to SD card was successfully", fn);
            webSrv.sendStatus(200);
        }
        else
            webSrv.sendStatus(400);
    }
    else {
        _f_SD_Upload = false;
        if(!startsWith(fileName, "/")) {
            strcpy(fn, "/");
            strcat(fn, fileName);
        }
        else { strcpy(fn, fileName); }
        if(webSrv.uploadfile(SD_MMC, fn, contentLength)) {
            SerialPrintfln("save file:   " ANSI_ESC_CYAN "%s" ANSI_ESC_WHITE " to SD card was successfully", fn);
            webSrv.sendStatus(200);
        }
        else {
            SerialPrintfln("save file:   " ANSI_ESC_CYAN "%s" ANSI_ESC_WHITE " to SD failed", fn);
            webSrv.sendStatus(400);
        }
        if(strcmp(fn, "/stations.csv") == 0) saveStationsToNVS();
    }
}

String setTone() { // vs1053
    uint8_t ha = _toneha;
    uint8_t hf = _tonehf;
    uint8_t la = _tonela;
    uint8_t lf = _tonelf;
    audioSetTone(ha, hf, la, lf);
    sprintf(_chbuf, "toneha=%i\ntonehf=%i\ntonela=%i\ntonelf=%i\n", ha, hf, la, lf);
    String tone = String(_chbuf);
    return tone;
}

String setI2STone() {
    int8_t LP = _toneLP;
    int8_t BP = _toneBP;
    int8_t HP = _toneHP;
    audioSetTone(LP, BP, HP);
    sprintf(_chbuf, "LowPass=%i\nBandPass=%i\nHighPass=%i\n", LP, BP, HP);
    String tone = String(_chbuf);
    return tone;
}

void SD_playFile(const char* path, uint32_t resumeFilePos, bool showFN) {
    if(!path) return; // avoid a possible crash
    if(endsWith(path, "ogg")) resumeFilePos = 0; // resume only mp3, m4a, flac and wav
    if(endsWith(path, "m3u")) {
        playlistFile.close();                    // as a precaution
        if(SD_MMC.exists(path)) {
            playlistFile = SD_MMC.open(path);
            _f_playlistEnabled = false;
            processPlaylist(true);
        }
        return;
    }
    showVolumeBar();
    int32_t idx = lastIndexOf(path, '/');
    if(idx < 0) return;
    if(showFN) {clearLogo(); showFileName(path + idx + 1);}
    changeState(PLAYERico);
    connecttoFS((const char*)path, resumeFilePos);
    showFileNumber();
    if(_f_isFSConnected) {
        free(_lastconnectedfile);
        _lastconnectedfile = x_ps_strdup(path);
        _resumeFilePos = 0;
    }
}

