schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
void DLNA_browseServer(String objectId, uint8_t level) {
    // Here the user selects the DLNA server whose content he wants to see, level 0 is root
    if(level == 0) { _currentServer = objectId.toInt(); }
    soap.browseServer(_currentServer, objectId.c_str());
}

void DLNA_getFileItems(String uri) {
    String   _media_downloadIP = soap.getMediaDownloadIP();
    uint16_t _media_downloadPort = soap.getMediaDownloadPort();

    log_v("uri: %s", uri.c_str());
    log_v("downloadIP: %s", _media_downloadIP.c_str());
    log_v("downloadport: %d", _media_downloadPort);
    String URL = "http://" + _media_downloadIP + ":" + _media_downloadPort + "/" + uri;
    // log_i("URL=%s", URL.c_str());
    _cur_Codec = 0;
    _f_isWebConnected = audioConnecttohost(URL.c_str());
    _f_isFSConnected = false;
}
void DLNA_showContent(String objectId, uint8_t level) {
    audioStopSong();
    log_v("obkId=%s", objectId.c_str());
    if(level == 0) { DLNA_browseServer(objectId, level); }
    if(objectId.startsWith("D=")) {
        objectId = objectId.substring(2);
        DLNA_browseServer(objectId, level);
    }
    if(objectId.startsWith("F=")) {
        objectId = objectId.substring(2);
        DLNA_getFileItems(objectId);
    }
}

void showDlnaItemsList(uint8_t level, uint16_t itemNr){
    clearWithOutHeaderFooter();
    uint16_t itemsSize = 0;
    if(level == 0){                                  // show DLNA server names
        itemsSize = _dlna_items.serverFriendlyName.size();
        if(itemsSize < 10) itemNr = 0;
    }
    else{
        itemsSize = _dlna_items.name.size();
        if(itemsSize < 10) itemNr = 0; // show DLNA items
    }
    log_i("level %d, itemsSize %d", level, itemsSize);
    showHeadlineItem(DLNA);
    tft.setCursor(10, _winFooter.h) ;
    tft.setTextColor(TFT_ORANGE);
    if(level > 0)  tft.writeText((uint8_t*)_dlna_items.path[0], -1,-1, true);
    tft.setTextColor(TFT_WHITE);
    tft.setFont(_fonts[1]);
    uint8_t lineHight = _winWoHF.h / 10;
    for(uint8_t pos = 1; pos < 10; pos++){
        if(pos == 1 && itemNr > 0){
            tft.setCursor(0, _winFooter.h + (pos) * lineHight);
            tft.setTextColor(TFT_AQUAMARINE);
            tft.writeText((uint8_t*)"˄");
        }
        if(pos == 9 && itemNr + 9 < itemsSize){
            tft.setCursor(0, _winFooter.h + (pos) * lineHight);
            tft.setTextColor(TFT_AQUAMARINE);
            tft.writeText((uint8_t*)"˅");
        }
        if(itemNr + pos > itemsSize) break;
        tft.setCursor(20, _winFooter.h + (pos) * lineHight);
        if(level == 0){
            tft.setTextColor(TFT_LIME);
            tft.writeText((uint8_t*)_dlna_items.serverFriendlyName[(pos - 1) + itemNr], -1, -1, true);
        }
        else{
            //    if(indexOf(_SD_content[pos + itemNr - 1 ], "\033[", 0) == -1) tft.setTextColor(TFT_GRAY); // is folder
            //    else tft.setTextColor(TFT_WHITE);                                                     // is file
        }
    }
    _timeCounter.timer = 10;
    _timeCounter.factor = 1.0;
}

/*****************************************************************************************************************************************************
 *                                                                 L O O P                                                                           *
 *****************************************************************************************************************************************************/
void loop() {
    if(!_f_ESPfound) return;    // Guard:  wrong chip?
    if(!_f_SD_MMCfound) return; // Guard:  SD_MMC could not be initialisized
    webSrv.loop();
    ir.loop();
    tp.loop();
    ftpSrv.handleFTP();
    soap.loop();
    if(_f_muteDecrement) {
        if(_mute_volume > 0) {
            _mute_volume--;
            audioSetVolume(_mute_volume);
            showHeadlineVolume();
        }
        else {
            if(AMP_ENABLED != -1) digitalWrite(AMP_ENABLED, LOW);
            _f_muteDecrement = false;
            _f_mute = true;
            webSrv.send("mute=1");
            if(_state == RADIOico || _state == PLAYERico || _state == DLNA) { drawImage("/btn/Button_Mute_Red.jpg", 0, _winButton.y); }
            if(_state == CLOCKico) { drawImage("/btn/Button_Mute_Red.jpg", 2 * _winButton.w, _winButton.y); }
        }
    }

    if(_f_muteIncrement) {
        if(_mute_volume < _cur_volume) {
            _mute_volume++;
            audioSetVolume(_mute_volume);
            showHeadlineVolume();
        }
        else {
            _f_muteIncrement = false;
            _f_mute = false;
            webSrv.send("mute=0");
            if(_state == RADIOico || _state == PLAYERico) { drawImage("/btn/Button_Mute_Green.jpg", 0, _winButton.y); }
            if(_state == CLOCKico) { drawImage("/btn/Button_Mute_Green.jpg", 2 * _winButton.w, _winButton.y); }
        }
    }
    if(!_f_sleeping) {
        if(_f_newBitRate) {
            showFooterBitRate(_icyBitRate);
            _f_newBitRate = false;
        }

        if(_f_newLogoAndStation) {
            showLogoAndStationName();
            _f_newLogoAndStation = false;
        }

        if(_f_100ms) {
            _f_100ms = false;
            if(_state != ALARM) updateVUmeter();
        }
    }
    if(_f_1sec) {
        _f_1sec = false;
        if(!_f_sleeping) {
            showHeadlineTime(false);
            showFooterRSSI();
            if(_state == CLOCK || _state == CLOCKico) display_time();
        }

        if(_timeCounter.timer) {
            _timeCounter.timer--;
            if(_timeCounter.timer < 10){
                sprintf(_chbuf, "/common/tc%02d.bmp", uint8_t(_timeCounter.timer * _timeCounter.factor));
                drawImage(_chbuf, _winRSSID.x, _winRSSID.y);
            }
            if(!_timeCounter.timer) {
                showFooterRSSI(true);
                if(     _state == RADIOico) { changeState(RADIO); }
                else if(_state == RADIOmenue) { changeState(RADIO); }
                else if(_state == CLOCKico) { changeState(CLOCK); }
                else if(_state == RADIO && _f_switchToClock) { changeState(CLOCK); _f_switchToClock = false; }
                else if(_state == STATIONSLIST) { changeState(RADIO); }
                else if(_state == AUDIOFILESLIST) { changeState(PLAYER); }
                else if(_state == DLNAITEMSLIST) { changeState(DLNA); }
                else { ; } // all other, do nothing
            }
        }
        if(_f_rtc == true) { // true -> rtc has the current time
            int8_t h = 0;
            String time_s;
            xSemaphoreTake(mutex_rtc, portMAX_DELAY);
            time_s = rtc.gettime_s();
            xSemaphoreGive(mutex_rtc);
            if(_f_eof && (_state == RADIO || _f_eof_alarm)) {
                _f_eof = false;
                if(_f_eof_alarm) {
                    audioSetVolume(_cur_volume);
                    wake_up();
                    _f_eof_alarm = false;
                }
                else { connecttohost(_lastconnectedhost.c_str()); }
            }
            if(_f_eof && _state == PLAYERico){
                if(!_f_playlistEnabled && !_f_playAllFiles){
                    _f_eof = false;
                    changeState(PLAYER);
                }
            }

            if((_f_mute == false) && (!_f_sleeping)) {
                if(time_s.endsWith("59:53") && _state == RADIO) { // speech the time 7 sec before a new hour is arrived
                    String hour = time_s.substring(0, 2);         // extract the hour
                    h = hour.toInt();
                    h++;
                    if(h == 24) h = 0;
                    if(_f_timeAnnouncement) {
                        if(_timeFormat == 12) if(h > 12) h -=  12;
                        sprintf(_chbuf, "/voice_time/%d_00.mp3", h);
                        SerialPrintfln("Time: ...... play Audiofile %s", _chbuf) connecttoFS(_chbuf);
                    }
                    else { SerialPrintfln("Time: ...... Announcement at %d o'clock is silent", h); }
                }
            }

