schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
    switch(_releaseNr){
        /* RADIOico ******************************/
        case  0:    /*changeBtn_released(0);*/                               break; // Mute
        case  1:    changeBtn_released(1); downvolume(); showVolumeBar();    break;  // Vol-
        case  2:    changeBtn_released(2); upvolume();   showVolumeBar();    break;  // Vol+
        case  3:    changeBtn_released(3); prevStation(); showFooterStaNr(); break;  // previousstation
        case  4:    changeBtn_released(4); nextStation(); showFooterStaNr(); break;  // nextstation
        case  5:    changeBtn_released(5); changeState(STATIONSLIST); break;  //  list stations

        /* RADIOmenue ******************************/
        case 10:    changeState(PLAYER); break;
        case 11:    changeState(DLNA); break;
        case 12:    changeState(CLOCK); break;
        case 13:    changeState(SLEEP); break;
        case 14:    changeState(BRIGHTNESS); break;

        /* CLOCKico ******************************/
        case 20:    changeState(ALARM); break;
        case 21:    changeState(RADIO); break;
        case 22:    changeBtn_released(2); break; // Mute
        case 23:    changeBtn_released(3); downvolume(); /* showVolumeBar(); */ break;
        case 24:    changeBtn_released(4); upvolume();   /* showVolumeBar();*/ break;

        /* ALARM ******************************/
        case 30:    changeBtn_released(0); display_alarmtime(-1 ,  0); break;
        case 31:    changeBtn_released(1); display_alarmtime( 1 ,  0); break;
        case 32:    changeBtn_released(2); display_alarmtime( 0 ,  1); break;
        case 33:    changeBtn_released(3); display_alarmtime( 0 , -1); break;
        case 34:    changeState(CLOCK); break;

        /* AUDIOPLAYER ******************************/
        case 40:    changeBtn_released(0); // previous audiofile
                    if(_cur_AudioFileNr > 0){
                        _cur_AudioFileNr--;
                        showFileName(_SD_content[_cur_AudioFileNr]);
                        showFileNumber();
                    }
                    break;
        case 41:    changeBtn_released(1); // next audiofile
                    if(_cur_AudioFileNr + 1 < _SD_content.size()){
                        _cur_AudioFileNr++;
                        showFileName(_SD_content[_cur_AudioFileNr]);
                        showFileNumber();
                    }
                    break;
        case 42:    changeState(PLAYERico); showVolumeBar(); // ready
                    sprintf(_chbuf, "%s/%s", _curAudioFolder.c_str() ,_SD_content[_cur_AudioFileNr]);
                    {
                        int32_t idx = indexOf(_chbuf, "\033[", 1);
                        if(idx == -1) break;  // is folder
                        _chbuf[idx] = '\0';  // remove color and filesize
                    }
                    changeState(PLAYERico);
                    SD_playFile(_chbuf, 0, true);
                    break;
        case 43:    _f_shuffle = false; SD_playFolder(_curAudioFolder.c_str(), true); break;  // in alphabetical order
        case 44:    _f_shuffle = true;  SD_playFolder(_curAudioFolder.c_str(), true); break;  // with shuffle
        case 45:    SerialPrintfln(ANSI_ESC_YELLOW "Button number: %d is unsed yet", _releaseNr); break;
        case 46:    SD_listDir(_curAudioFolder.c_str(), true, false); changeState(AUDIOFILESLIST);break;
        case 47:    changeBtn_released(0); changeState(RADIO); break; // RADIO

        /* AUDIOPLAYERico ******************************/
        case 50:    changeBtn_released(0); break; // Mute
        case 51:    changeBtn_released(1); downvolume(); showVolumeBar(); break; // Vol-
        case 52:    changeBtn_released(2); upvolume();   showVolumeBar(); break; // Vol+
        case 53:    if(_f_isFSConnected){
                        if(!_f_pauseResume){_f_pauseResume = true; // toggle pause/resume an set the flag
                            _pressBtn[3] = "/btn/Button_Right_Yellow.jpg"; _releaseBtn[3] = "/btn/Button_Right_Blue.jpg";
                            SerialPrintfln("Audioplayer: " ANSI_ESC_GREEN "Audio file is paused");}
                        else {_f_pauseResume = false;
                            _pressBtn[3] = "/btn/Button_Pause_Yellow.jpg"; _releaseBtn[3] = "/btn/Button_Pause_Blue.jpg";
                            SerialPrintfln("Audioplayer: " ANSI_ESC_GREEN "Audio file is resumed");}
                        drawImage(_releaseBtn[3], 3 * _winButton.w,  _winButton.y);
                        audioPauseResume();
                    }
                    else{
                        changeBtn_released(3);
                        SerialPrintfln("Audioplayer: " ANSI_ESC_GREEN "Web files can't be paused");
                    }
                    break;
        case 54:    stopSong(); changeState(PLAYER);  break;
        case 55:    SerialPrintfln(ANSI_ESC_YELLOW "Button number: %d is unsed yet", _releaseNr); break;
        case 56:    SerialPrintfln(ANSI_ESC_YELLOW "Button number: %d is unsed yet", _releaseNr); break;
        case 57:    stopSong(); changeState(RADIO); break;

        /* ALARM (weekdays) ******************************/
        case 60:    display_alarmDays(0); break;  // sun
        case 61:    display_alarmDays(1); break;  // mon
        case 62:    display_alarmDays(2); break;
        case 63:    display_alarmDays(3); break;
        case 64:    display_alarmDays(4); break;
        case 65:    display_alarmDays(5); break;
        case 66:    display_alarmDays(6); break;

        /* SLEEP ******************************************/
        case 70:    display_sleeptime(1);  changeBtn_released(0); break;
        case 71:    display_sleeptime(-1); changeBtn_released(1); break;
        case 72:    updateSleepTime(true);
                    changeBtn_released(2);
                    changeState(RADIO); break;
        case 73:    changeBtn_released(3); break; // unused
        case 74:    _sleeptime = 0;
                    changeBtn_released(4);
                    changeState(RADIO); break;

        /* BRIGHTNESS ************************************/
        case 80:    downBrightness(); changeBtn_released(0); break;
        case 81:    upBrightness();   changeBtn_released(1); break;
        case 82:    changeState(RADIO); break;

        /* DLNA ******************************************/
        case 90:    changeBtn_released(0); break; // Mute
        case 91:    changeBtn_released(1); downvolume(); showVolumeBar();  break;  // Vol-
        case 92:    changeBtn_released(2); upvolume();   showVolumeBar();  break;  // Vol+
        case 93:    changeState(DLNAITEMSLIST); break;
        case 97:    changeState(RADIO); break;

        /* STATIONSLIST *********************************/
        case 100:   if(y -_winHeader.h >= 0 && y -_winHeader.h <= _winWoHF.h){
                        uint8_t staListPos = (y -_winHeader.h)  / (_winWoHF.h / 10);
                        if(_staListPos + 2 < staListPos){               // wipe down
                            if(_staListNr == 0) break;
                            if(_staListNr >  9) _staListNr -= 9;
                            else _staListNr = 0;
                            showStationsList(_staListNr);
                        }
                        else if(staListPos + 2 < _staListPos){          // wipe up
                            if(_staListNr + 9 >= _sum_stations) break;
                            _staListNr += 9;
                            showStationsList(_staListNr);
                        }
                        else if(staListPos == _staListPos){
                            uint16_t staNr = _staListNr + staListPos + 1;
                            if(staNr > _sum_stations){
                                SerialPrintfln(ANSI_ESC_YELLOW "Touchpoint not valid x=%d, y=%d", x, y);
                                break;
                            }
                            uint8_t lineHight = _winWoHF.h / 10;
                            tft.setCursor(10, _winFooter.h + (staListPos) * lineHight);
                            sprintf(_chbuf, "station_%03d", staNr);
                            String content = stations.getString(_chbuf, " #not_found");
                            int32_t idx = content.indexOf("#");
                            sprintf(_chbuf, ANSI_ESC_YELLOW"%03d " ANSI_ESC_CYAN "%s\n",staNr, content.substring(0, idx).c_str());
                            tft.writeText((uint8_t*)_chbuf, -1, -1, true);
                            _timeCounter.timer = 0;
                            showFooterRSSI(true);
                            setStation(staNr);
                            changeState(RADIO);
                        }
                        else log_i("unknown gesture");
                    } break;
        /* AUDIOFILESLIST *******************************/
        case 110:   if(y -_winHeader.h >= 0 && y -_winHeader.h <= _winWoHF.h){
                        uint8_t fileListPos = (y -_winHeader.h)  / (_winWoHF.h / 10);
                        if(_fileListPos + 2 < fileListPos){               // wipe down
                            if(_fileListNr == 0) break;
                            if(_fileListNr >  9) _fileListNr -= 9;
                            else _fileListNr = 0;
                            showAudioFilesList(_fileListNr);
                        }
                        else if(fileListPos + 2 < _fileListPos){          // wipe up
                            if(_fileListNr + 9 >= _SD_content.size()) break;
                            _fileListNr += 9;
                            showAudioFilesList(_fileListNr);
                        }
                        else if(fileListPos == _fileListPos){
                            uint16_t fileNr = _fileListNr + fileListPos;
                            if(fileNr > _SD_content.size()){
                                SerialPrintfln(ANSI_ESC_YELLOW "Touchpoint not valid x=%d, y=%d", x, y);
                                break;
                            }
                            uint8_t lineHight = _winWoHF.h / 10;
                            tft.setCursor(20, _winFooter.h + (fileListPos) * lineHight);
                            if(fileListPos == 0) {
                                int32_t idx = _curAudioFolder.lastIndexOf("/");
                                if(idx > 1){ // not the first '/'
                                    _curAudioFolder = _curAudioFolder.substring(0, idx);
                                    _fileListNr = 0;
                                    SD_listDir(_curAudioFolder.c_str(), true, false);
                                    showAudioFilesList(_fileListNr);
                                    break;
                                }
                            }
                            else{
                                if(fileNr > _SD_content.size()) break;
                                tft.setTextColor(TFT_CYAN);
                                _cur_AudioFileNr = fileNr - 1;
                                tft.writeText((uint8_t*)_SD_content[_cur_AudioFileNr], -1, -1, true);
                                sprintf(_chbuf, "%s/%s", _curAudioFolder.c_str() ,_SD_content[_cur_AudioFileNr]);
                                int32_t idx = indexOf(_chbuf, "\033[", 1);
                                if(idx == -1){ // is folder
                                    _curAudioFolder += "/" + (String)_SD_content[_cur_AudioFileNr];
                                    _fileListNr = 0;
                                    SD_listDir(_curAudioFolder.c_str(), true, false);
                                    showAudioFilesList(_fileListNr);
                                    break;
                                }
                                else {
                                    _chbuf[idx] = '\0';  // remove color and filesize
                                    changeState(PLAYERico);
                                    log_i("fn %s", _chbuf);
                                    SD_playFile(_chbuf, 0, true);
                                }
                            }
                            _timeCounter.timer = 0;
                            showFooterRSSI(true);
                        }
                        else log_i("unknown gesture");
                    } break;
        /* DLNAITEMSLIST *********************************/
        case 120:   if(y -_winHeader.h >= 0 && y -_winHeader.h <= _winWoHF.h){
                        uint8_t itemListPos = (y -_winHeader.h)  / (_winWoHF.h / 10);
                        if(_itemListPos + 2 < itemListPos){               // wipe down
                            if(_itemListNr == 0) break;
                            if(_itemListNr >  9) _itemListNr -= 9;
                            else _itemListNr = 0;
                            showDlnaItemsList( 0,   _itemListNr);
                        }
                        else if(itemListPos + 2 < _itemListPos){          // wipe up
                            if(_itemListNr + 9 >= _SD_content.size()) break;
                            _itemListNr += 9;
                            showDlnaItemsList( 0,    _itemListNr);
                        }





