schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
                    } break;

        default:    break;
    }
    _releaseNr = -1;
}

void tp_long_released(){
    // log_w("long released)");
    if(_releaseNr == 0 || _releaseNr == 22 || _releaseNr == 50) {return;}
    tp_released(0, 0);
}

//Events from websrv
void WEBSRV_onCommand(const String cmd, const String param, const String arg){  // called from html

    if(CORE_DEBUG_LEVEL == ARDUHAL_LOG_LEVEL_WARN){
        SerialPrintfln("WS_onCmd:    " ANSI_ESC_YELLOW "cmd=\"%s\", params=\"%s\", arg=\"%s\"",
                                                        cmd.c_str(),param.c_str(), arg.c_str());
    }

    String  str;

    if(cmd == "homepage"){          webSrv.send("homepage=" + _homepage);
                                    return;}

    if(cmd == "to_listen"){         StationsItems(); // via websocket, return the name and number of the current station
                                    return;}

    if(cmd == "gettone"){           if(DECODER) webSrv.send((String)"settone=" + setI2STone().c_str());
                                    else        webSrv.send((String)"settone=" + setTone().c_str());
                                    return;}

    if(cmd == "getmute"){           if(_f_mute) webSrv.send("mute=1");
                                    else        webSrv.send("mute=0");
                                    return;}

    if(cmd == "setmute"){           mute();
                                    return;}

    if(cmd == "getstreamtitle"){    webSrv.reply(_streamTitle, webSrv.TEXT);
                                    return;}

    if(cmd == "toneha"){            _toneha = param.toInt();                           // vs1053 treble gain
                                    setTone();
                                    char lp[40] = "tone=Treble Gain set to "; strcat(lp, param.c_str()); strcat(lp, "dB");
                                    webSrv.send(lp); return;}
    if(cmd == "tonehf"){            _tonehf = param.toInt();                           // vs1053 treble frequency
                                    setTone();
                                    char lp[40] = "tone=Treble Frecquency set to "; strcat(lp, param.c_str()); strcat(lp, "KHz");
                                    webSrv.send(lp); return;}
    if(cmd == "tonela"){            _tonela = param.toInt();                           // vs1053 bass gain
                                    setTone();
                                    char lp[40] = "tone=Bass Gain set to "; strcat(lp, param.c_str()); strcat(lp, "dB");
                                    webSrv.send(lp); return;}
    if(cmd == "tonelf"){            _tonelf = param.toInt();                           // vs1053 bass frequency
                                    setTone();
                                    char lp[40] = "tone=Bass Frecquency set to "; strcat(lp, param.c_str()); strcat(lp, "KHz");
                                    webSrv.send(lp); return;}
    if(cmd == "LowPass"){           _toneLP = param.toInt();                           // audioI2S tone
                                    char lp[30] = "tone=Lowpass set to "; strcat(lp, param.c_str()); strcat(lp, "dB");
                                    webSrv.send(lp); setI2STone(); return;}

    if(cmd == "BandPass"){          _toneBP = param.toInt();                           // audioI2S tone
                                    char bp[30] = "tone=Bandpass set to "; strcat(bp, param.c_str()); strcat(bp, "dB");
                                    webSrv.send(bp); setI2STone(); return;}

    if(cmd == "HighPass"){          _toneHP = param.toInt();                           // audioI2S tone
                                    char hp[30] = "tone=Highpass set to "; strcat(hp, param.c_str()); strcat(hp, "dB");
                                    webSrv.send(hp); setI2STone(); return;}

    if(cmd == "uploadfile"){        _filename = param;  return;}

    if(cmd == "upvolume"){          webSrv.send("volume=" + (String)upvolume());  return;}                                                            // via websocket

    if(cmd == "downvolume"){        webSrv.send("volume=" + (String)downvolume()); return;}                                                           // via websocket

    if(cmd == "prev_station"){      prevStation(); return;}                                                                                           // via websocket

    if(cmd == "next_station"){      nextStation(); return;}                                                                                           // via websocket

    if(cmd == "set_station"){       setStation(param.toInt()); return;}                                                                               // via websocket

    if(cmd == "stationURL"){        setStationViaURL(param.c_str()); return;}                                                                         // via websocket

    if(cmd == "getnetworks"){       webSrv.send((String)"networks=" + WiFi.SSID().c_str()); return;}                                                  // via websocket

    if(cmd == "ping"){              webSrv.send("pong"); return;}                                                                                     // via websocket

    if(cmd == "index.html"){        if(_f_accessPoint) {SerialPrintfln("Webpage:     " ANSI_ESC_ORANGE "accesspoint.html");                           // via XMLHttpRequest
                                                        webSrv.show(accesspoint_html, webSrv.TEXT);}
                                    else               {SerialPrintfln("Webpage:     " ANSI_ESC_ORANGE "index.html");
                                                        webSrv.show(index_html, webSrv.TEXT);      }
                                    return;}

    if(cmd == "index.js"){          SerialPrintfln("Script:      " ANSI_ESC_ORANGE "index.js");                                                       // via XMLHttpRequest
                                    webSrv.show(index_js, webSrv.JS); return;}

    if(cmd == "get_tftSize"){       webSrv.send(_tftSize? "tftSize=m": "tftSize=s"); return;}

    if(cmd == "getTimeZones"){      webSrv.streamfile(SD_MMC, "/timezones.csv"); return;}

